src_doc/Tasks/ЗадачаИсполнителя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Task>
		<Properties>
			<Name>ЗадачаИсполнителя</Name>
			<Addressing>InformationRegister.ИсполнителиРолей</Addressing>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор бизнес-процесса, который сформировал задачу</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Comment>Важность задачи - для приоритезации исполнителем своих задач</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыВажностиОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполнения</Name>
					<Comment>Дата и время фактического выполнения задачи</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Comment>Дата начала выполнения задачи - для приоритезации исполнителем своих задач</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПринятияКИсполнению</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Comment>Описание постановки задачи для исполнителя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторИсполнителя</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсключенаИзПроцесса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметСтрокой</Name>
					<Comment>Строковое представление предмета</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отменена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринятаКИсполнению</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатВыполнения</Name>
					<Comment>Описание результата выполнения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроектнаяЗадача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроектныеЗадачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеБизнесПроцесса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияБизнесПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокИсполнения</Name>
					<Comment>Плановый срок исполнения задачи</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийИсполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ПолныеРоли</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактическийИсполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФактическиеИсполнители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Предметы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РольПредмета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РолиПредметов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПредмета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИменаПредметов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Предмет</Name>
							<Comment>Предмет задачи</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.УведомленияПрограммы</v8:Type>
								<v8:Type>cfg:CatalogRef.ТемыОбсуждений</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
								<v8:Type>cfg:CatalogRef.ПротоколыМероприятий</v8:Type>
								<v8:Type>cfg:DocumentRef.ВходящееПисьмо</v8:Type>
								<v8:Type>cfg:DocumentRef.ИсходящееПисьмо</v8:Type>
								<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
								<v8:Type>cfg:DocumentRef.Бронь</v8:Type>
								<v8:Type>cfg:CatalogRef.ДокументыПредприятия</v8:Type>
								<v8:Type>cfg:CatalogRef.СообщенияОбсуждений</v8:Type>
								<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
								<v8:Type>cfg:CatalogRef.ПроектныеЗадачи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоступноУдаление</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбязательноеЗаполнение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<AddressingAttribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>РольИсполнителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПолныеРоли</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

src_doc/InformationRegisters/СоставСубъектовПравДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СоставСубъектовПравДоступа</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СотрудникПометкаУдаления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубъектПометкаУдаления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Субъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПолныеРоли</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяОбластиДелегирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектОснование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.ЗамещающиеИПомощники</v8:Type>
						<v8:Type>cfg:CatalogRef.УдалитьДелегированиеПрав</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СотрудникОснование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбластьДелегирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбластиЗамещения</v8:Type>
						<v8:Type>cfg:CatalogRef.УдалитьОбластиДелегированияПрав</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_doc/InformationRegisters/ВсеИсполнителиДействийЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ВсеИсполнителиДействийЗадач</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ДействиеЗадачи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ДействиеЗадачи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗамещающиеИПомощники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_doc/Tasks/ЗадачаИсполнителя/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Проверяет является ли переданная задача процесса служебной.
//
// Параметры:
//  Задача - ЗадачаОбъект.ЗадачаИсполнителя,
//           ЗадачаСсылка.ЗадачаИсполнителя,
//           Структура со свойствами Исполнитель, РольИсполнителя, ТочкаМаршрута, Наименование, БизнесПроцесс
//
// Возвращаемое значение:
//  Булево
//
Функция ЭтаСлужебнаяЗадачаПроцесса(Задача) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТипЗадачи = ТипЗнч(Задача);
	
	РеквизитыЗадачи = Неопределено;
	Если ТипЗадачи = Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда
		РеквизитыЗадачи = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			Задача, "Исполнитель, РольИсполнителя, ТочкаМаршрута, Наименование, БизнесПроцесс");
	ИначеЕсли ТипЗадачи = Тип("ЗадачаОбъект.ЗадачаИсполнителя")
		Или ТипЗадачи = Тип("Структура") Тогда
		
		РеквизитыЗадачи = Задача;
	КонецЕсли;
	
	МенеджерПроцесса = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Задача.БизнесПроцесс);
	
	Возврат МенеджерПроцесса.ЭтаСлужебнаяЗадачаПроцесса(РеквизитыЗадачи)
		Или (Не ЗначениеЗаполнено(РеквизитыЗадачи.Исполнитель)
			И Не ЗначениеЗаполнено(РеквизитыЗадачи.РольИсполнителя));
	
КонецФункции

#Область ОбновлениеКэширующихДанных

// Обрабатывает обновление кэширующих данных.
// 
// Параметры:
//  Выборка - ВыборкаИзРезультатаЗапроса - Выборка из очереди обновления кэширующих данных:
//   * ОтметкаВремени - ОпределяемыйТип.ОтметкаВремени.
//   * ЗависимыйОбъектМетаданных - СправочникСсылка.ИдентификаторыОбъектовМетаданных.
//   * ВлияющийОбъектМетаданных - СправочникСсылка.ИдентификаторыОбъектовМетаданных.
//   * КлючВлияющихДанных - ЛюбаяСсылка.
//   * Автор - СправочникСсылка.Пользователи.
//   * ЗагрузкаОбработанныхДанныхИзДругойСистемы - Булево.
//   * ИзмененияВлияющихДанных - ХранилищеЗначения.
//   * Попыток - Число.
//   * ДатаКОбработке - Дата.
// 
Процедура ОбновитьКэширующиеДанные(Выборка) Экспорт      
	
	Попытка
		
		ПараметрыСеанса.МиграцияДанныхРазрешеноПрерываниеПроцессов = Истина;
	
		БизнесПроцесс = Выборка.КлючВлияющихДанных;  
		
		БизнесПроцессыИЗадачиВызовСервера.ПрерватьБизнесПроцесс(
			БизнесПроцесс, НСтр("ru = 'Прерывание процессов загруженных из ДО 2.1 при выключении загрузки.'"));
			
		ПротоколированиеРаботыСотрудников.ЗаписатьПрерываниеБизнесПроцесса(БизнесПроцесс);	
			
		ПараметрыСеанса.МиграцияДанныхРазрешеноПрерываниеПроцессов = Ложь;	
		
	Исключение
		
		ПараметрыСеанса.МиграцияДанныхРазрешеноПрерываниеПроцессов = Ложь;
		ВызватьИсключение;
			
	КонецПопытки;		
	
КонецПроцедуры

#КонецОбласти

#Область ДляВызоваИзДругихПодсистем

#Область ПраваДоступа

// Проверяет наличие метода ПраваСотрудниковПоОбъектам
// 
// Возвращаемое значение:
//  Булево - Есть ли метод ПраваСотрудниковПоОбъектам
Функция ЕстьМетодПраваПравообладателейПоОбъектам() Экспорт
	
	Возврат Истина;
	
КонецФункции

// Возвращает права доступа правообладателей, т.е. сотрудников или пользователей, к объектам.
// 
// Параметры:
//  ОбъектыДоступа - Массив Из ЛюбаяСсылка - Ссылки на объекты, чьи права нужно получить.
//	СотрудникиОтбор - Массив Из СправочникСсылка.Сотрудники - Сотрудники для отбора.
//					- Неопределено -
//	ПользователиОтбор - Массив Из СправочникСсылка.Пользователи - Пользователи для отбора.
//					  - Неопределено -
//
// Возвращаемое значение:
//  См. ДокументооборотПраваДоступа.ТаблицаПравСотрудниковПоОбъектам
Функция ПраваПравообладателейПоОбъектам(
	ОбъектыДоступа, СотрудникиОтбор = Неопределено, ПользователиОтбор = Неопределено) Экспорт
	
	ТаблицаПрав = ДокументооборотПраваДоступа.ТаблицаПравСотрудниковПоОбъектам();
	
	Если ОбъектыДоступа.Количество() = 0 Тогда
		Возврат ТаблицаПрав;
	КонецЕсли;
	
	ПервыйОбъектДоступа = ОбъектыДоступа[0];
	ИдентификаторОМ = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ПервыйОбъектДоступа.Метаданные());
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
			"// ВТПраваНаЧтениеДобавление //////////////////////////////////////
			|ВЫБРАТЬ
			|	ЗадачаИсполнителя.Ссылка КАК ОбъектДоступа,
			|	СоставСубъектов.Сотрудник КАК Сотрудник,
			|	СоставСубъектов.Пользователь КАК Пользователь,
			|	ИСТИНА КАК Чтение,
			|	МАКСИМУМ(ВЫБОР
			|		КОГДА ЗадачаИсполнителя.Автор = СоставСубъектов.Сотрудник
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ) КАК Добавление
			|ПОМЕСТИТЬ ВТПраваНаЧтениеДобавление
			|ИЗ
			|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УчастникиПроцессов КАК УчастникиПроцессов
			|		ПО (ЗадачаИсполнителя.БизнесПроцесс = УчастникиПроцессов.Процесс)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоставСубъектовПравДоступа КАК СоставСубъектов
			|		ПО (УчастникиПроцессов.Участник = СоставСубъектов.Субъект)
			|		И (СоставСубъектов.ИмяОбластиДелегирования В (&ОбластиДелегирования))
			|		И &СоставСубъектов_ОтборПравообладателей
			|ГДЕ
			|	ЗадачаИсполнителя.Ссылка В (&ОбъектыДоступа)
			|СГРУППИРОВАТЬ ПО
			|	ЗадачаИсполнителя.Ссылка,
			|	СоставСубъектов.Сотрудник,
			|	СоставСубъектов.Пользователь
			|;
			|
			|// ВТПраваНаИзменение ////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ЗадачаИсполнителя.Ссылка КАК ОбъектДоступа,
			|	СоставСубъектов.Сотрудник КАК Сотрудник,
			|	СоставСубъектов.Пользователь КАК Пользователь,
			|	ИСТИНА КАК Изменение
			|ПОМЕСТИТЬ ВТПраваНаИзменение
			|ИЗ
			|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоставСубъектовПравДоступа КАК СоставСубъектов
			|		ПО ЗадачаИсполнителя.ТекущийИсполнитель = СоставСубъектов.Субъект
			|		И (СоставСубъектов.ИмяОбластиДелегирования В (&ОбластиДелегирования))
			|		И &СоставСубъектов_ОтборПравообладателей
			|ГДЕ
			|	ЗадачаИсполнителя.Ссылка В (&ОбъектыДоступа)
			|СГРУППИРОВАТЬ ПО
			|	ЗадачаИсполнителя.Ссылка,
			|	СоставСубъектов.Сотрудник,
			|	СоставСубъектов.Пользователь
			|;
			|
			|// ВТСубъектыСотрудника ///////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	СоставСубъектов.Субъект КАК Субъект,
			|	СоставСубъектов.Сотрудник КАК Сотрудник,
			|	СоставСубъектов.Пользователь КАК Пользователь
			|ПОМЕСТИТЬ ВТСубъектыСотрудника
			|ИЗ
			|	РегистрСведений.СоставСубъектовПравДоступа КАК СоставСубъектов
			|ГДЕ
			|	&СоставСубъектов_ОтборПравообладателей
			|	И СоставСубъектов.ИмяОбластиДелегирования В ("""", ""Задачи"", ""ЗадачиПросмотр"")
			|;
			|
			|// ВТПраваПоДействиямЗадач /////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЗадачаИсполнителя.Ссылка КАК Задача,
			|	ИСТИНА КАК Чтение,
			|	ИСТИНА КАК Изменение,
			|	ИСТИНА КАК Добавление,
			|	ЛОЖЬ КАК Удаление,
			|	СубъектыСотрудника.Сотрудник КАК Исполнитель,
			|	СубъектыСотрудника.Пользователь КАК Пользователь,
			|	ЛОЖЬ КАК УправлениеПравами
			|ПОМЕСТИТЬ ВТПраваПоДействиямЗадач
			|ИЗ
			|	РегистрСведений.ВсеИсполнителиДействийЗадач КАК ВсеИсполнителиДействийЗадач
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ДействиеЗадачи КАК ДействияЗадач
			|		ПО ВсеИсполнителиДействийЗадач.ДействиеЗадачи = ДействияЗадач.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
			|		ПО (ДействияЗадач.Источник = ЗадачаИсполнителя.Ссылка)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСубъектыСотрудника КАК СубъектыСотрудника
			|		ПО ВсеИсполнителиДействийЗадач.Исполнитель = СубъектыСотрудника.Субъект
			|ГДЕ
			|	ЗадачаИсполнителя.Ссылка В (&ОбъектыДоступа)
			|;
			|
			|// ВТПраваПоЗадаче /////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПраваНаЧтениеДобавление.ОбъектДоступа КАК ОбъектДоступа,
			|	ПраваНаЧтениеДобавление.Сотрудник КАК Сотрудник,
			|	ПраваНаЧтениеДобавление.Пользователь КАК Пользователь,
			|	ПраваНаЧтениеДобавление.Чтение КАК Чтение,
			|	ЕСТЬNULL(ПраваНаИзменение.Изменение, ЛОЖЬ) КАК Изменение,
			|	ПраваНаЧтениеДобавление.Добавление КАК Добавление,
			|	ЛОЖЬ КАК Удаление,
			|	ЛОЖЬ КАК УправлениеПравами
			|ПОМЕСТИТЬ ВТПраваПоЗадаче
			|ИЗ
			|	ВТПраваНаЧтениеДобавление КАК ПраваНаЧтениеДобавление
			|	ЛЕВОЕ СОЕДИНЕНИЕ
			|	ВТПраваНаИзменение КАК ПраваНаИзменение
			|		ПО ПраваНаЧтениеДобавление.ОбъектДоступа = ПраваНаИзменение.ОбъектДоступа
			|		И ПраваНаЧтениеДобавление.Сотрудник = ПраваНаИзменение.Сотрудник
			|		И ПраваНаЧтениеДобавление.Пользователь = ПраваНаИзменение.Пользователь
			|;
			|
			|// ПраваПоВсемИсточникам ////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПраваПоЗадаче.ОбъектДоступа КАК ОбъектДоступа,
			|	ПраваПоЗадаче.Сотрудник КАК Сотрудник,
			|	ПраваПоЗадаче.Пользователь КАК Пользователь,
			|	ПраваПоЗадаче.Изменение КАК Изменение,
			|	ПраваПоЗадаче.Добавление КАК Добавление,
			|	ПраваПоЗадаче.Удаление КАК Удаление,
			|	ПраваПоЗадаче.УправлениеПравами КАК УправлениеПравами,
			|	ПраваПоЗадаче.Чтение КАК Чтение
			|ПОМЕСТИТЬ ВТПраваПоВсемИсточникам
			|ИЗ
			|	ВТПраваПоЗадаче КАК ПраваПоЗадаче
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ПраваПоДействиямЗадач.Задача,
			|	ПраваПоДействиямЗадач.Исполнитель,
			|	ПраваПоДействиямЗадач.Пользователь,
			|	ПраваПоДействиямЗадач.Изменение,
			|	ПраваПоДействиямЗадач.Добавление,
			|	ПраваПоДействиямЗадач.Удаление,
			|	ПраваПоДействиямЗадач.УправлениеПравами,
			|	ПраваПоДействиямЗадач.Чтение
			|ИЗ
			|	ВТПраваПоДействиямЗадач КАК ПраваПоДействиямЗадач
			|;
			|
			|// Финальный итог ///////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПраваПоВсемИсточникам.ОбъектДоступа КАК ОбъектДоступа,
			|	ПраваПоВсемИсточникам.Сотрудник КАК Сотрудник,
			|	ПраваПоВсемИсточникам.Пользователь КАК Пользователь,
			|	МАКСИМУМ(ПраваПоВсемИсточникам.Изменение) КАК Изменение,
			|	МАКСИМУМ(ПраваПоВсемИсточникам.Изменение) КАК Добавление,
			|	МАКСИМУМ(ПраваПоВсемИсточникам.Добавление) КАК Удаление,
			|	МАКСИМУМ(ПраваПоВсемИсточникам.Удаление) КАК УправлениеПравами,
			|	МАКСИМУМ(ПраваПоВсемИсточникам.Чтение) КАК Чтение
			|ИЗ
			|	ВТПраваПоВсемИсточникам КАК ПраваПоВсемИсточникам
			|СГРУППИРОВАТЬ ПО
			|	ПраваПоВсемИсточникам.ОбъектДоступа,
			|	ПраваПоВсемИсточникам.Сотрудник,
			|	ПраваПоВсемИсточникам.Пользователь";
	Запрос.УстановитьПараметр("ОбъектыДоступа", ОбъектыДоступа);
	
	ДокументооборотПраваДоступа.ПодменитьОтборПравообладателейВЗапросе(
		Запрос, "&СоставСубъектов_ОтборПравообладателей", "СоставСубъектов", СотрудникиОтбор, ПользователиОтбор);
	
	Запрос.УстановитьПараметр("ИдентификаторОМ", ИдентификаторОМ);
	Запрос.УстановитьПараметр(
		"ОбластиДелегирования",
		ЗамещающиеИПомощники.ИменаОбластейЗамещенияПоИдентификаторуОбъектаМетаданных(ИдентификаторОМ));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаПрав.Добавить(), Выборка);
	КонецЦикла;
	
	ДокументооборотПраваДоступа.РасширитьТаблицуПравНеограниченнымиПравами(
		ТаблицаПрав, ИдентификаторОМ, ОбъектыДоступа, СотрудникиОтбор, ПользователиОтбор);
	
	Возврат ТаблицаПрав;
	
КонецФункции

#Область УстаревшиеПроцедурыИФункции

// Устарела.
// См. ЕстьМетодПраваПравообладателейПоОбъектам
// 
// Возвращаемое значение:
//  Булево -
Функция ЕстьМетодПраваСотрудниковПоОбъектам() Экспорт
	
	Возврат Истина;
	
КонецФункции

// Устарела. См. ПраваПравообладателейПоОбъектам
// 
// Параметры:
//  ОбъектыДоступа - Массив Из ЛюбаяСсылка - Типы - См. Объект в РегистрСведений.ДескрипторыДляОбъектов
//  СотрудникиОтбор - Массив Из СправочникСсылка.Сотрудники -
//  				- Неопределено -
// 
// Возвращаемое значение:
//  См. ДокументооборотПраваДоступа.ТаблицаПравСотрудниковПоОбъектам
Функция ПраваСотрудниковПоОбъектам(ОбъектыДоступа, СотрудникиОтбор = Неопределено) Экспорт
	
	Возврат ПраваПравообладателейПоОбъектам(ОбъектыДоступа, СотрудникиОтбор);
	
КонецФункции

#КонецОбласти // УстаревшиеПроцедурыИФункции

#КонецОбласти // ПраваДоступа

#КонецОбласти // ДляВызоваИзДругихПодсистем

#КонецОбласти // ПрограммныйИнтерфейс

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Наименование");
	Поля.Добавить("Дата")
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекстПредставления = НСтр("ru = '%1 от %2'");
	
	Представление = СтрШаблон(
		ТекстПредставления,
		Данные.Наименование,
		Данные.Дата);
	
КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка) Экспорт
	
	Если РаботаСПроцессамиПоОбработкамОбъектовСобытия.ОбработатьПолучениеФормыЗадачи(
		ВидФормы, Параметры, ВыбраннаяФорма, СтандартнаяОбработка) Тогда
		
		Возврат;		
	КонецЕсли;
	
	Если ВидФормы = "ФормаОбъекта"
		И Параметры.Свойство("Ключ")
		И ЗначениеЗаполнено(Параметры.Ключ) Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		Если Не ОбщегоНазначения.СсылкаСуществует(Параметры.Ключ) Тогда
			ВызватьИсключение СтрШаблон(
				НСтр("ru = 'Не удалось перейти по ссылке ""%1"" по причине: Неверно задана навигационная ссылка.'"),
				ПолучитьНавигационнуюСсылку(Параметры.Ключ));
		КонецЕсли;
		
		Если ЭтаСлужебнаяЗадачаПроцесса(Параметры.Ключ) Тогда
			Возврат;
		КонецЕсли;
		
		// Найдём существующе действие задачи.
		ДействиеЗадачиПоИсточнику = Документы.ДействиеЗадачи.НайтиПоИсточнику(Параметры.Ключ);
		Если ЗначениеЗаполнено(ДействиеЗадачиПоИсточнику) Тогда
			
			Параметры.Ключ = ДействиеЗадачиПоИсточнику;
			
			Документы.ДействиеЗадачи.ОбработкаПолученияФормы(
				ВидФормы,
				Параметры,
				ВыбраннаяФорма,
				ДополнительнаяИнформация,
				СтандартнаяОбработка);
			
			Возврат;
			
		КонецЕсли;
		
		// Попробуем обновить задачу и найти снова действие задачи.
		БизнесПроцесс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Ключ, "БизнесПроцесс");
		ИнтеграцияЗадач.ОбновитьЗадачуПоИсточнику(БизнесПроцесс);
		ДействиеЗадачиПоИсточнику = Документы.ДействиеЗадачи.НайтиПоИсточнику(Параметры.Ключ);
		Если ЗначениеЗаполнено(ДействиеЗадачиПоИсточнику) Тогда
			
			Параметры.Ключ = ДействиеЗадачиПоИсточнику;
			
			Документы.ДействиеЗадачи.ОбработкаПолученияФормы(
				ВидФормы,
				Параметры,
				ВыбраннаяФорма,
				ДополнительнаяИнформация,
				СтандартнаяОбработка);
			
			Возврат;
			
		КонецЕсли;
		
		СтандартнаяОбработка = Ложь;
		ВыбраннаяФорма = "Задача.ЗадачаИсполнителя.Форма.ПодробнаяФормаЗадачи";
		
	ИначеЕсли ВидФормы = "ФормаВыбора" Тогда
		СтандартнаяОбработка = Ложь;
		ВыбраннаяФорма = "Задача.ЗадачаИсполнителя.Форма.ФормаСписка";
		Параметры.Вставить("РежимВыбора", Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
